Revit 2027 API
DisplayingOptionsDialogEventArgs.PagesCount Property
 The count of pages in the options dialog (include the default pages added by Revit).
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int PagesCount { get; }
Public ReadOnly Property PagesCount As Integer
	Get
public:
property int PagesCount {
	int get ();
}
member PagesCount : int with get
Property Value
Int32
See Also
Reference
DisplayingOptionsDialogEventArgs Class
Autodesk.Revit.UI.Events Namespace